[
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "The Most Common Fabric Stains (and how to remove them)",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/frabic-stains-remover.jpg",
        "publishedDate": "2020-08-11",
        "articles": [],
        "id": "most-common-fabric-stains-1608593897"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "The Beauty of the Backyard Bar",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/backyard-bar-artile.jpg",
        "publishedDate": "2020-08-07",
        "text": "<p>Some of the best summer memories revolve around sipping on a tasty drink al fresco in the company of your favourite people. But if you’re playing host, it’s no fun to duck back inside for refills just as your buddy is about to tell the best part of his infamous bear story. A well-stocked backyard bar can save you from such indignities, and it doesn’t take much to keep the party outside.&nbsp;</p>\r\n<p>Whether you have tons of outdoor space, or if your back patio is the size of a postage stamp, backyard bars come in all shapes and sizes. Just keep in mind that, more often than not, people tend to use their bar areas either later in the afternoon or during the evening. You want to set it up in a shady spot that faces north, south, or east, because no one wants to play mixologist while squinting into the sun. Not a sexy look. If you’re a fan of cocktails that require <a title=\"Head to our store to check out our  Salton Harley Blender\" href=\"https://shop.rumi.ca/collections/small-appliances/products/salton-harley-pasternak-power-blender\" target=\"_blank\">a blender</a> (Frozen margaritas? Obviously!) or any other electrical appliance, you’ll also need to make sure the bar is located near an outlet.&nbsp;&nbsp;<br>\r\n</p>\r\n<p>The most effective outdoor bars have two important features: storage space for liquor, glassware and mixing tools—as well as some sort of cooling or refrigeration mechanism. An <a title=\"Head to our store to check out the Dandy Outdoor Compact Refrigerator\" href=\"https://shop.rumi.ca/collections/small-appliances/products/danby-3-3-cu-ft-outdoor-compact-refrigerator\" target=\"_blank\">outdoor fridge</a> is a great way to keep chilled beer and wine close at hand, and many modern mixologists even swear by portable <a title=\"Head to our store to check out our Dandy Ice Maker\" href=\"https://shop.rumi.ca/collections/outdoor-living-s/products/danby-2lb-ice-maker\" target=\"_blank\">ice makers</a> to keep the party going. The best part? These small appliances don’t require a water line—that’s what makes them so great for outdoor entertaining.&nbsp;<br>\r\n</p>\r\n<p>&nbsp;</p>\r\n<h3>Getting Setup With Glassware&nbsp;<br>\r\n</h3>\r\n<p>First thing’s first: make sure you’ve stocked your personal patio speakeasy with the appropriate glassware. Your options may vary depending on the specific drinks you plan on pouring, but it’s always a good idea to have a reliable supply of <a title=\"Head to our store to check out our Cuisivin Beer Glass\" href=\"https://shop.rumi.ca/products/cuisivin-canadiana-animal-print-beer-glass-6pk\" target=\"_blank\">beer glasses</a>, <a title=\"Head to our store to check out our Cuisivin Stemless Wine Glasses\" href=\"https://shop.rumi.ca/products/cuisivin-canadiana-muskoka-print-stemless-wine-glass-6pk\" target=\"_blank\">wine glasses</a> and <a title=\"Head to our store to check out our Cuisivin Whiskey Tumbler\" href=\"https://shop.rumi.ca/products/cuisivin-glendale-dof-whiskey-tumbler-6pk\" target=\"_blank\">tumblers</a>. And make sure you have enough! Washing glasses mid-party sort of kills the outdoor vibe.&nbsp;<br>\r\n</p>\r\n<p>If your summertime celebrations tend to involve a collection of blended drinks, it’s smart to include a <a title=\"Head to our store to check out our Hutch Fridge Carafe\" href=\"https://shop.rumi.ca/collections/entertaining/products/hutch-fridge-carafe\" target=\"_blank\">carafe</a> in your artisanal arsenal.&nbsp; You can always build from there and add <a title=\"Head to our store to check out our Cuisivin Martini Glasses\" href=\"https://shop.rumi.ca/products/cuisivin-martini-glass-6pk\" target=\"_blank\">martini glasses</a> or even a <a title=\"Head to our store to check out our Cuisivin Whiskey Taster Flight Set\" href=\"https://shop.rumi.ca/products/cuisivin-whiskey-taster-flight-set\" target=\"_blank\">whiskey taster flight set</a> if being a little extra is in your DNA.&nbsp;&nbsp;<br>\r\n</p>\r\n<p>&nbsp;</p>\r\n<h3>The Backyard Barkeep’s Tools of the Trade&nbsp;<br>\r\n</h3>\r\n<p>This is where the real fun begins. Your libations will be ready for the ‘gram when you invest in a <a title=\"Head to our store to check out our Swissmar Bar Set \" href=\"https://shop.rumi.ca/collections/entertaining/products/swissmar-7-piece-bar-set-stainless-steel\" target=\"_blank\">solid set of bar tools</a> that can be stored safely and accessed easily. The best bar toolkits begin with a strainer, a <a title=\"Head to our store to check out our Nuance Cocktail Shaker\" href=\"https://shop.rumi.ca/collections/entertaining/products/nuance-stainless-steel-cocktail-shaker\" target=\"_blank\">good shaker</a> and a bar spoon for thorough stirring. A jigger is essential for measuring shots accurately. If you really want to play Tom Cruise’s role in Cocktail (we all have dreams), invest in a quality set of liquor pourers to boot.&nbsp;<br>\r\n</p>\r\n<p>Presentation matters, and everyone, well, anyone you’d want to hang out with, appreciates a nice garnish atop their drink. A <a title=\"Head to our store to check out our Nuance Bar Acessory Set\" href=\"https://shop.rumi.ca/collections/entertaining/products/nuance-4-piece-bar-accessory-set-stainless-steel\" target=\"_blank\">high quality strainer and zester</a> go a long way when it comes to crafting a bevvy that’s as pretty as it is tasty.&nbsp;&nbsp;<br>\r\n</p>\r\n<p>It’s wise to have several bottle openers handy. Nobody will earn a trip to the dentist trying the old teeth-as-bottle-opener technique on your watch. You might even want to bolt an opener to the side of the bar with a trash bin beneath it just to make sure your backyard stays neat and tidy. Speaking of keeping things clean, don’t forget to stock up on napkins.&nbsp;&nbsp;<br>\r\n</p>\r\n<p>&nbsp;</p>\r\n<h3>The Main Event&nbsp;&nbsp;</h3>\r\n<p>Stocking up: Stocking your outdoor bar with alcohol and mixers can feel overwhelming at first, but a bit of organization can go a long way. We know it’s fun to have it all, but it is possible to avoid unnecessary purchases by taking the time to research and narrow down your bar menu to only a few select cocktails you’re interested in making. Compile a list of the cocktails you love, add a few that you think friends might enjoy and only buy the liquor used in those. Even better if a few cocktails share many of the same ingredients.&nbsp;<br>\r\n</p>\r\n<p><b>The basics: </b>Almost any drink request can be created using vodka, gin, tequila, rum, or whiskey. These are the essentials, and you should have a bottle of each at your fingertips. When you feel confident and want to level up your options, consider adding triple sec, vermouth and a nice bourbon or scotch to your behind-the-bar team. While the time of year can influence your guests’ drink requests, know that beer and wine are always in season.&nbsp;&nbsp;<br>\r\n</p>\r\n<p><b>Mixer magic: </b>A steady supply of soda and tonic water is essential, as well as margarita mix, olives, fresh limes and lemons. Sugar and salt on the rim of a glass is always a nice touch. Keeping a small bottle of bitters and a simple syrup on hand is a good idea as well.&nbsp; &nbsp;<br>\r\n</p>\r\n<p><b>Softer stuff:</b> And don’t leave out the teetotalers! Just because a drink doesn’t contain alcohol doesn’t mean it can’t be fun. Have plenty of sparkling water and other soft drinks on hand in order to satisfy everyone.&nbsp;<br>\r\n</p>\r\n<p>&nbsp;</p>\r\n<h3>The Bar is Open&nbsp;</h3>\r\n<p>When it’s this easy to pull together an outdoor bar, there’s no excuse not to try it. When you add in some comfy seating, a few tunes and mood lighting, you’ll pretty much be open for business. Cheers!&nbsp;</p>\r\n",
        "articles": [],
        "id": "backyard-bar-923672346"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Finding & Fixing Your Main Water Shutoff Valve",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/water-shutoff-valve-artile.jpg",
        "publishedDate": "2020-08-05",
        "text": "<p>Water is wonderful when it’s where it’s supposed to be - in a glass on the nightstand, falling from the sky on a mild summer’s day, or dripping peacefully off the edge of an infinity pool at your luxury resort. Ahh. That’s a nice visual.</p>\r\n<p>That being said, few things strike more panic into a homeowner’s heart than the sight of water where you don’t want it to be - leaking from a running toilet, streaming from a burst pipe, dripping from a busted water heater. Even something as seemingly insignificant as a leaky sink can cause serious damage to your home in a very short amount of time. Knowing exactly where your main water shutoff valve is located and how to turn off the water supply as soon as a leak, spill or flood occurs can save your home from costly damages.</p>\r\n<p>It’s important you’re familiar with the main shutoff valve’s location and function before an emergency occurs. When the pressure is on, you’ll know exactly where to go and how to jump into action.</p>\r\n<p>&nbsp;</p>\r\n<h4>The Little Valve That Could (Save Your Home)<br>\r\n</h4>\r\n<p>In order to reach the main shutoff valve, all water entering your home must first pass through at least three valves installed by the city. Since you aren’t in control of the city’s valves, it’s best to know just how to take control of the waterflow in your very own home. When facing a household water-related emergency, the main shutoff is the first place you need to go in order to prevent the damage from spreading. This important piece of plumbing is almost always located in the basement or on an exterior wall of a utility room.</p>\r\n<p>&nbsp;</p>\r\n<h4>Types of Main Shutoff Valves</h4>\r\n<h4>&nbsp;</h4>\r\n<h5>Gate Valve:&nbsp;<br>\r\n</h5>\r\n<p>These are ultra-reliable and will last you for years. Gate valves are the ones that have a round, screw-like knob—envision the knob that’s on many homes’ outdoor water taps. Close the gate valve by turning it in a clockwise motion. The drawback is that, if not regularly turned, they can become stuck. If you have a gate valve, we highly recommend taking a moment to close and reopen it every 3 to 6 months, just to keep things loose and moving freely.</p>\r\n<p>If you find your gate-style valve has gotten stuck, spray the stem with penetrating oil (e.g., WD-40) and wipe off the excess with a dry rag. Then, using a wrench or a hammer, lightly tap the valve to get it to open up.</p>\r\n<h5>Ball Valve:<br>\r\n</h5>\r\n<p>This kind of valve is extremely sturdy and easy to use in all kinds of climates. It has a lever, or handle, on top of the valve that you can turn into either the open or shut position. The motion that is required to operate the valve is quick and minimal compared to the sometimes-cumbersome gate valves.</p>\r\n<p>The ball valve is open when the handle aligns with the pipe itself. To close it and shut off the water supply, pull the handle clockwise so that it’s at a right angle to the pipe.</p>\r\n<p>&nbsp;</p>\r\n<h4>Turning the Water Back On<br>\r\n</h4>\r\n<p>Before you turn the water back on, it’s important you take a moment to unscrew the small screens known as “aerators” from the ends of all of your household faucets. This prevents loose particles in the pipes from clogging the tiny holes in the aerators.</p>\r\n<p>There will often be some leakage near the valve’s stem after you have reopened it post-repair. As soon as you notice a leak, gently tighten the packing nut that’s holding the valve’s stem in place. Tighten it<br>\r\nenough to stop the leak and no more than that - over tightening this nut will make the valve hard to turn again.</p>\r\n<p>&nbsp;</p>\r\n<h4>You Got This<br>\r\n</h4>\r\n<p>Every homeowner should know where their valves are located and how to operate them. You’ll be so proud of yourself when you’re able to go from zero to hero and jump into action the next time there’s a moment of plumbing peril in your home.</p>\r\n",
        "articles": [
            {
                "title": "Home Lawn Maintenance",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/lawn-care-artile.jpg"
            },
            {
                "title": "Maintaining your Deck",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/deck-maintenance-artile.jpg"
            },
            {
                "title": "Cleaning your Dryer Vent",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/cleaning-dryer-vent-artile.jpg"
            }
        ],
        "id": "water-shutoff-valve-263028845"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Clean Your Dishwasher, So Your Dishwasher Can Clean ",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/dishwasher-cleaning-artile.jpg",
        "publishedDate": "2020-07-30",
        "text": "<p>“Cleaning” the dishwasher sounds like an oxymoron, right? Believe it or not, you should clean your dishwasher monthly. While your dishwasher reliably scrubs your daily dishes, it also needs a little cleaning of its own. Mineral buildup, extra food particles and grease can all cause this (mostly) silent workhorse to underperform.&nbsp;<br>\r\n&nbsp;<br>\r\nFortunately, keeping the machine that’s built to clean, clean, is easy!<br>\r\n&nbsp;</p>\r\n<h4>Step 1: Check the filter</h4>\r\n<p>Refer to your dishwasher user manual (paper or online) to confirm if your machine has a filter. If it does, empty and clean the filter first. You can even take a toothpick to thoroughly dig out all the little holes.<br>\r\n</p>\r\n<p>&nbsp;</p>\r\n<h4>Step 2: Choose a way to clean<br>\r\n</h4>\r\n<ul>\r\n<li>Vinegar: Fill a small bowl (that’s dishwasher safe, of course) with white vinegar and place it in the top rack. Run an empty load on the hottest setting. The vinegar will spray around the machine and deodorize as it descales mineral and grease buildup. Note: Don’t mix vinegar and baking soda together, as the two will actually neutralize one another. Learn more about the benefits of cleaning with vinegar <a title=\"Read our blog on how to clean your home with vinegar\" href=\"https://www.rumi.ca/en-ca/stories/clean-your-home-vinegar-naturally.html\">here</a>.</li>\r\n<li>Commercial dishwasher cleaners: Available at most grocery and home supply stores, commercial cleaners cost more than DIY solutions but are convenient and quick to pop in whenever your machine needs a little more sparkle.</li>\r\n<li>Bleach: For non-stainless-steel machines only. If you have acquired a mold or mildew issue, bleach will disinfect the inside and help kill unwanted bacteria. NEVER mix bleach with other ingredients, including vinegar and baking soda, as certain combinations can produce dangerous fumes.&nbsp;</li>\r\n</ul>\r\n<p>&nbsp;</p>\r\n<h4>Step 3: Don’t forget the exterior</h4>\r\n<ul>\r\n<li>Wipe the front panel with hot soapy water. If it’s a stainless-steel finish, follow up with a dab of stainless-steel cleaner. Buff the cleaner with a clean microfibre cloth to make the outside really shine.</li>\r\n<li>Clean the gasket. The gasket? You know, that soft piece of rubber that creates a waterproof seal between the door and the inside compartment. Gently wash the gasket with hot soapy water, using an old, soft toothbrush if necessary.&nbsp;<br>\r\n</li>\r\n</ul>\r\n<h4>&nbsp;<br>\r\nStep 4: Repeat Steps 2 &amp; 3 on a monthly basis&nbsp;<br>\r\n</h4>\r\n<p>And there you have it. Four super simple steps to a cleaner dishwasher that will continue to take everything you throw at it, and stuff into it, for years and years to come.</p>\r\n",
        "articles": [
            {
                "title": "Unclog your Kitchen Drain",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/unclogging-drains-artile.jpg"
            },
            {
                "title": "Cleaning Tips for your Living Room",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/living-room-cleaning-article tile.jpg"
            },
            {
                "title": "Cleaning Your Floors",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/cleaning-floors-article-tile.jpg"
            }
        ],
        "id": "dishwasher-cleaning-1152740213"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "5 Simple Steps for Cleaning Your Bathroom Exhaust Fan",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/cleaning-bathroom-exhaust-artile.jpg",
        "publishedDate": "2020-07-24",
        "text": "<p>When it comes to cleaning the bathroom, there’s one job in particular that most of us tend to put off until it becomes more of a problem than it should be: cleaning your bathroom exhaust fan. Your fan actually needs to receive a good, thorough cleaning every 6 months in order to function properly, so we really should pay more attention to it.</p>\r\n<p>One reason we ignore this task is because, well, “out of sight, out of mind.” There are no little lights or beeps that signal “Hey! Up here! Clean me!” But it must be said: properly cleaning your bathroom’s exhaust fan is an important job that needs to be done consistently to keep this room functional and comfortable.<br />\r\n</p>\r\n<p>That fan helps rid your bathroom of lingering odors and works to reduce the amount of moisture in the air, hindering the growth and spread of mold and mildew. It also works to remove the airborne contaminants left behind by many household cleaning products. If your fan is caked in dust bunnies and other various unmentionables, then it can’t work efficiently. When the fan can’t do its job, the excess moisture has nowhere to go, and your porcelain sanctum can slowly but surely become a hot, moldy mess.<br />\r\n</p>\r\n<p> </p>\r\n<p><b>Step 1: Remove the Bathroom Vent Cover</b></p>\r\n<p>First thing’s first: Safety, folks. Unplug the fan if accessible or turn off the fan at the circuit breaker to make sure no power is flowing to it while you’re working.<br />\r\n</p>\r\n<p>In order to safely remove the cover and get to the fan itself, you should gently and carefully pull down on the cover; once you have done so, the fan should be visible behind it. With the cover fully extended, squeeze the metal mounting wires on either side of the cover and gently slide them out of their respective slots. At this point, you can probably see the amount of dust and dirt that you are going up against. Now the real fun begins.<br />\r\n</p>\r\n<p> </p>\r\n<p><b>Step 2: Cleaning the Vent Cover</b></p>\r\n<p>This part of the cleaning process is very simple and straightforward. In order to have a properly functioning fan, the vent cover needs to be cleaned out and rinsed thoroughly. This can be accomplished using your bathroom’s sink, some warm water, and 3 or 4 drops of dish soap. The vent cover should be left to soak in the soapy water for about 5 minutes in order to loosen up any impacted particles or clumps of debris.<br />\r\n</p>\r\n<p>After the soaking is done, you should lightly scrub the fan cover with a cloth or a dish brush. Once the cover is free of dust, dirt and grime, you can leave it to air dry on a fresh towel. While the fan’s cover is drying out, it’s time to get to the main event: cleaning the actual exhaust fan.<br />\r\n</p>\r\n<p> </p>\r\n<p><b>Step 3: Dusting the Exhaust Fan</b></p>\r\n<p>Find some protective goggles or glasses, and let’s get to it.<br />\r\n</p>\r\n<p>Using a dust buster or your full-sized vacuum’s extension wand, start removing the dust from the fan blades themselves. To clean the fan’s motor, housing and other components, you will want to use the vacuum bristle brush attachment. The crevice cleaning attachment is probably perfect for the hardest to reach areas of the motor.<br />\r\n</p>\r\n<p> </p>\r\n<p><b>Step 4: Removing the Excess Build Up</b></p>\r\n<p>Your vacuum skills just took care of the dry, loose dust that accumulated. Now things get really interesting. You can probably see clearly the exhaust fan is covered in a pretty good layer or grime. To clean this off, just use a dampened microfiber cloth and carefully wipe down the fan’s blades, motor housing and other components.<br />\r\n</p>\r\n<p> </p>\r\n<p><b>Step 5: Finishing Up</b></p>\r\n<p>Having cleaned the fan completely and washed and dried the cover, you can start putting things back together. Carefully plug the fan back in if you unplugged it while the cover was off.<br />\r\n</p>\r\n<p>Next, take the cover, squeeze the mounting wires and insert them into the slots. After pushing the cover back into place, you can now safely return to the fuse box and restore power to the bathroom.<br />\r\n</p>\r\n<p>And that’s it! Your bathroom, and your bathroom vent will thank you until it’s time to repeat the process six months from now.<br />\r\n</p>\r\n",
        "articles": [],
        "id": "cleaning-bathroom-exhaust-fan-1254910864"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Every Season is Cleaning Season! Rümi’s Cleaning Checklist Makes it Easy to Stay on Track ",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/seasonal-cleaning-checklist-artile.jpg",
        "publishedDate": "2020-07-13",
        "text": "<p>As the seasons change, so does your cleaning checklist as different items in your home need special attention to ensure you’re ready for whatever the weather has in store for you. While summer is a good time to power wash your deck, it obviously wouldn’t make sense to put that on your to-do list for winter. And, changing your furnace filter is definitely a smart practice for November, but it might not make it to the top of your list in May. </p>\r\n<p>Beyond the regular dusting, washing and vacuuming we all do year round, Rümi’s got a few extra items that are a good idea to check off every season—plus more season-specific tips you’ll want to pay attention to as well. </p>\r\n<p>Now let’s get to it! <br />\r\n</p>\r\n<p> </p>\r\n<p><b>Deep Cleaning Basics </b><br />\r\n</p>\r\n<p>As the world turns, you are going to want to address the following tasks two-to-four times per year. These items don’t rely on the weather outside, but the beginning of every quarter is a gentle reminder that the more in-depth stuff still needs to get done. <br />\r\n</p>\r\n<p> </p>\r\n<p><b>Your Quarterly Checklist </b></p>\r\n<ul>\r\n<li>Wash vents and baseboards </li>\r\n<li>Do paint touch ups <br />\r\n</li>\r\n<li>Move and clean under large appliances <br />\r\n</li>\r\n<li>Wipe down ceiling fans, lights, and door and window casings <br />\r\n</li>\r\n<li>Clean out pantry <br />\r\n</li>\r\n<li>Deep clean the oven—consider one of the many non-toxic methods that use baking soda and/or vinegar available on the Internet <br />\r\n</li>\r\n<li>Wipe down the inside of cabinets <br />\r\n</li>\r\n<li>Rotate/flip mattresses – did you know that your mattress may also need a deep clean? We’re happy to help with that.  <br />\r\n</li>\r\n<li>Shampoo carpets and upholstery (<a title=\"View our Carpet Cleaning Services\" href=\"https://www.rumi.ca/en-ca/services/carpet-cleaning.html\">We can help with that too</a>!) <br />\r\n</li>\r\n</ul>\r\n<p> </p>\r\n<p><b>Spring-Specific Checklist </b></p>\r\n<ul>\r\n<li>Prep garden soil for planting—lay down new topsoil and/or compost, be sure all old plant material is turned under the soil, and rake the soil clean before planting </li>\r\n<li>Clean out tool shed and/or garage – sweep out dirt and debris, throw away any garbage, take junk or hire for <a title=\"View our Junk Removal Services\" href=\"https://www.rumi.ca/en-ca/services/junk-removal.html\">junk removal </a><br />\r\n</li>\r\n<li>Wash porches/decks <br />\r\n</li>\r\n<li>Wash interior windows and window tracks <br />\r\n</li>\r\n<li>Check that AC units are in good working order <br />\r\n</li>\r\n<li>Take a look inside your clothes closet. Is there anything in there that hasn’t been worn in the past year? If so, consider donating any gently used items.  <br />\r\n</li>\r\n</ul>\r\n<p> </p>\r\n<p><b>Summer-Specific Checklist </b></p>\r\n<ul>\r\n<li>Deep clean the grill </li>\r\n<li>Perform maintenance on lawn mower <br />\r\n</li>\r\n<li>Clean patio furniture <br />\r\n</li>\r\n<li>Wash window exteriors  <br />\r\n</li>\r\n<li>Install/repair/maintain screen doors to keep dust and critters outside where they belong <br />\r\n</li>\r\n</ul>\r\n<p> </p>\r\n<p><b>Fall-Specific Checklist </b></p>\r\n<ul>\r\n<li>Change furnace filter  </li>\r\n<li>Clean furnace and ducts (<a title=\"View our Furnace and Duct cleaning services\" href=\"https://www.rumi.ca/en-ca/services/duct-furnace-cleaning.html\">We can also help with that</a>!) <br />\r\n</li>\r\n<li>Clean out fireplace <br />\r\n</li>\r\n<li>Switch out wardrobe – store summer coats and dig winter coats out of storage <br />\r\n</li>\r\n<li>Winterize patio furniture and play equipment, or store </li>\r\n</ul>\r\n<p> </p>\r\n<p><b>Winter-Specific Checklist </b></p>\r\n<ul>\r\n<li>Wash windows (inside) </li>\r\n<li>Wash blankets and throws <br />\r\n</li>\r\n<li>Prep mudroom by laying down absorbent entryway mats and provide plenty of hooks where big hands and little hands can hang up damp coats, gloves, and toques <br />\r\n</li>\r\n</ul>\r\n<p> </p>\r\n<p>Every season is deep cleaning season. But that doesn’t mean you can’t have some fun. The right tips and <a title=\"Browse through our Rümi products\" href=\"https://shop.rumi.ca/collections/all-product\" target=\"_blank\">tools</a> will help you feel like a home cleaning pro and inspire you to embrace the changing of every season. <br />\r\n</p>\r\n",
        "articles": [],
        "id": "seasonal-cleaning-checklist-1985541884"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Dryer Vent Cleaning: All the Reasons You Should Care About This Simple Maintenance Task",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/cleaning-dryer-vent-artile.jpg",
        "publishedDate": "2020-07-07",
        "text": "<p>When you’re writing up your home maintenance list, make sure to add the dryer vent. No, not that readily accessible lint filter inside your clothes dryer—although clean that, too. We’re referring to that larger duct (vent, tube, whatever you want to call it) that leads from the dryer to the outdoors.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><b>Is Cleaning the Dryer Duct Really Necessary?</b></p>\r\n<p>Yes! Not just necessary—mandatory. Did you know the leading cause of home fires in Canada is due to lint buildup in the dryer vent? Some simple maintenance for your clothes dryer is key.</p>\r\n<p>Safety is the biggie here with cleaning your dryer vent, but clogged ducts also affect your machine’s efficiency and can potentially shorten your dryer’s lifespan. Not a fan of buying a new clothes dryer prematurely? Neither are we. Check out the list below for some simple tips on how to better maintain your dryer and increase its lifespan.&nbsp;&nbsp;<br>\r\n</p>\r\n<p>&nbsp;</p>\r\n<p><b>Signs of Lint Buildup</b></p>\r\n<ul>\r\n<li>Clothes take longer to dry or remain damp at the end of a cycle</li>\r\n<li>Clothes are hotter than normal at the end of a cycle</li>\r\n<li>Dryer’s exterior is very hot to the touch</li>\r\n<li>Laundry room feels humid</li>\r\n<li>Lingering burnt smell in the laundry room</li>\r\n<li>Outside exhaust vent flapper does not open often, which means the dryer exhaust is not moving swiftly</li>\r\n</ul>\r\n<p>&nbsp;</p>\r\n<p><b>You <i>Can</i> Clean Dryer Vents Yourself. Here’s What You’ll Need:</b></p>\r\n<ul>\r\n<li>Vacuum with a long hose attachment</li>\r\n<li>Dryer vent brush kit*</li>\r\n<li>Screwdrivers</li>\r\n<li>UL-listed metal foil duct tape</li>\r\n</ul>\r\n<p>&nbsp;</p>\r\n<p><b>*What’s a Dryer Vent Brush Kit? (we knew that would be your next question)</b></p>\r\n<p>Standard vacuum attachments can’t reach deep inside the dryer’s duct work and agitate it free, but a brush kit can. They should contain two pieces:</p>\r\n<ol>\r\n<li>Long-bristle brush to clean the lint filter area</li>\r\n<li>Round-bristled brush with extendable pole</li>\r\n</ol>\r\n<p>&nbsp;</p>\r\n<p><b>Safety First</b></p>\r\n<p>Remember that flexible plastic or metal foil ductwork you used to see running from the dryer to the outside vent? It kind of looked like part of a homemade robot Halloween costume? Yeah, those are forbidden now because the ribbed inside surfaces can easily trap lint. Best to update this old-school ductwork with a smooth-walled option. But, if you can’t replace it, then just be hyper-vigilant about vacuuming it out.</p>\r\n<p>&nbsp;</p>\r\n<p><b>Cleaning Day Has Arrived, Follow These Steps:</b></p>\r\n<ol>\r\n<li>Unplug your dryer (if it’s gas-powered, turn the supply valve off while you work) and disconnect duct from the machine</li>\r\n<li>Vacuum lint trap housing with the long flexible brush</li>\r\n<li>Check duct work for damage—Replace if damaged, punctured or kinked</li>\r\n<li>Attach round-duct brush to flexible fiberglass pole and insert into each duct section, sweeping it clean by using a rotating, back-and-forth motion</li>\r\n<li>Add more sections to flexible rod until you reach the end of the rigid duct—Repeat until no more lint comes out</li>\r\n<li>Check vent cap at exterior to ensure it’s clean and works properly</li>\r\n<li>Reattach ductwork when job is complete</li>\r\n<li>Seal permanent duct sections with UL-listed metal foil duct tape—Do not use regular plastic duct tape, which dries out and fails over time</li>\r\n<li>Run the dryer to confirm it’s venting properly</li>\r\n</ol>\r\n<p><b>Note:</b> Some brush kits can be connected to a portable drill to spin the brush inside&nbsp;<span>the duct. If you use this option, run the drill at slow speed and advance the brush gradually through the duct.&nbsp;</span></p>\r\n<p>&nbsp;</p>\r\n<p><b>Fire Prevention</b></p>\r\n<ol>\r\n<li>Clear your dryer filter after every load</li>\r\n<li>Clean your ducts twice per year</li>\r\n<li>Only operate dryer when you are home</li>\r\n<li>Attach a safety alarm to the dryer—It can warn you when lint builds up</li>\r\n</ol>\r\n<p>&nbsp;</p>\r\n<p><b>DIY or Hire the Big Guys?</b></p>\r\n<p>See? It is possible to clean your own dryer vents! But, if your dryer vent is on the roof of your house, or if you are just not up to this handyman (or woman) task, <a title=\"Learn more about our Dryer Vent Cleaning Service\" href=\"https://www.rumi.ca/en-ca/services/dryer-vent-cleaning.html\">Rümi’s happy to help</a>.</p>\r\n<p>It’s important this household job receives regular attention. So, whether you do it yourself or call in a professional, what’s most important is this chore gets ticked off that to-do list.&nbsp;<br>\r\n</p>\r\n<p>Contact us anytime to <a title=\"Book your servive today\" href=\"https://www.rumi.ca/en-ca/book-service.html\">book in a service</a>.<br>\r\n</p>\r\n",
        "articles": [
            {
                "title": "Dishwasher Cleaning",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/dishwasher-cleaning-artile.jpg"
            },
            {
                "title": "Smoke Detector Safety",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/smoke-detector-safety.jpg"
            },
            {
                "title": "Bathroom Exhaust Fan Cleaning",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/cleaning-bathroom-exhaust-artile.jpg"
            }
        ],
        "id": "dryer-vent-cleaning-443312359"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Deck Life: With These 3 Maintenance Tips Your Deck Can Live its Best Life",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/deck-maintenance-artile.jpg",
        "publishedDate": "2020-06-30",
        "text": "<p>From morning coffee to refreshing evening cocktails, your deck sets the stage for the perfect summer. A great deck can support epic feasts with friends and family and safeguard bare feet against wet grass and critters during evening hang outs.</p>\r\n<p>A not-so-great deck? Well, that can be an invitation for everything from mold to mildew and those dreaded wood slivers.<br />\r\n</p>\r\n<p>Sure, there are only a handful of decks that make it to the cover of Amazing Deck Monthly, but any deck can be a glorious extension of your home. Let Rümi help you keep it in great shape.<br />\r\n</p>\r\n<h4>Top 3 Tips on Keeping your Deck in Ship Shape:</h4>\r\n<h4> </h4>\r\n<p><b>1. Inspect</b></p>\r\n<p>Mold and mildew will cause the wood in your deck to rot. Keeping your deck clean will reduce the gunk that can eat away the wood. Gunk that can eat away at your summer fun, on the deck.</p>\r\n<p>Inspect your deck mid-summer. Pay special attention to all areas that are within six inches of the ground or where water flows (planters, downspouts). Use a flat-edge screwdriver to test the wood for rot. Not sure what rotten wood feels like? Trust us, you’ll know it if you find it. Your screwdriver will sink into the rotten wood with ease, and you’ll be able to pull it away like dry dirt or wet paper towels. <br />\r\n</p>\r\n<p>Inspect all areas of your deck:<br />\r\n</p>\r\n<ul>\r\n<li>Stairs</li>\r\n<li>Hangers (those side pieces that support each stair)</li>\r\n<li>Joists</li>\r\n<li>Posts &amp; beams </li>\r\n</ul>\r\n<p><i>Pro Tip #1: If an area of rot is smaller than a loonie, remove the bad stuff and fill the hole with wood preserve. Larger affected areas may need to be replaced. Consult a professional for advice.<br />\r\n</i></p>\r\n<p><i>Pro Tip #2: If a structural component of your deck can’t be replaced, reinforce it! Add a splint of comparable wood with deck screws every six inches. Ensure the splint is secured into strong wood on either end then chisel away the rotten wood and treat the new stuff.</i><br />\r\n</p>\r\n<p>Deck railings should be solid and stable. Fix loose connections by tightening the screws or drilling pilot holes and adding new screws. <br />\r\n</p>\r\n<p>Remember to check the ledger. That’s the piece of frame that connects your deck to your house. Ledger failure is the leading cause of all deck collapses! The ledger should be rot free, connected with screws rather than nails, and the flashing (that piece of metal over the top that prevents water from getting behind the siding of your house) should be free of rust or holes.<br />\r\n</p>\r\n<p><b>2. Clean</b><br />\r\n</p>\r\n<p>Think of keeping your deck clean like keeping your teeth clean, you’ve gotta get in between the boards to remove that nasty wood plaque. Use a putty knife to scrape between each board, taking special care of the places where the boards cross members underneath. Yup, you should floss the boards of your deck.</p>\r\n<p>How to wash your deck:<br />\r\n</p>\r\n<ul>\r\n<li>Choose a less than sunny day to ensure your cleaner doesn’t evaporate before it can do its job</li>\r\n<li>Choose the appropriate cleaner for the surface (wood, composite) of your deck</li>\r\n<li>Wet any nearby plants and protect them with plastic film or move them off the deck if possible</li>\r\n<li>Sweep off any loose debris as well as the gunk that your deck flossing brought up</li>\r\n<li>Follow the instructions of the cleaner</li>\r\n</ul>\r\n<p><i>Pro Tip #1: Use a roller or stiff-bristled brush to apply the cleaner. Do not let your deck dry until you’ve applied cleaner to the entire surface. Then let it dry according to the instructions and wash thoroughly with water.<br />\r\n</i></p>\r\n<p><i>Pro Tip #2: When cleaning wood railings, work from the bottom up. This will minimize the possibility of the cleaner splattering onto already clean surfaces.</i></p>\r\n<p><b>3. Preserve</b></p>\r\n<p>Sealing your wood deck protects it from the elements in addition to protecting all those feet that gather on decks from slivers. And using a good sealant will keep it performing well for years. There are many types of sealers—clear, toner, solid—choose the look that’s right for you.</p>\r\n<p>Be sure to wear eye protection, a mask and gloves when applying sealant to your deck. Sealant must be applied to a dry surface, so you’ll need approximately two days of moderate weather and no rain before getting started. Plan accordingly as best you can. We know, we know—Canadian weather can turn on a dime and thumb its nose at the official forecast. Do the best you can.<br />\r\n</p>\r\n<p>Prep the deck:<br />\r\n</p>\r\n<ul>\r\n<li>Wash the entire deck</li>\r\n<li>Lightly sand to remove any of that furry stuff that appears after a good washing</li>\r\n<li>Replace or repair any protruding or missing nails &amp; screws</li>\r\n<li>Apply the sealer following manufacturer instructions</li>\r\n</ul>\r\n<p>Congrats! You’ve reached Deck Superstar Level! Following these steps will ensure your deck remains the focal point of your yard for years to come. Now that your deck maintenance is complete, check out <a title=\"Browse our Outdoor Living products\" href=\"https://shop.rumi.ca/collections/outdoor-living-s\">what’s in store</a> to make your outdoor living even sweeter. <br />\r\n</p>\r\n",
        "articles": [
            {
                "title": "Beauty of the Backyard Bar",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/backyard-bar-artile.jpg"
            },
            {
                "title": "Living your Best Summer Life",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/live-best-summer-life-2-artile.jpg"
            },
            {
                "title": "Home Lawn Maintenance",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/lawn-care-artile.jpg"
            }
        ],
        "id": "deck-maintenance-1586152482"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Virtual Home Checkups",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/virtual-home-checkup-artile.jpg",
        "publishedDate": "2020-06-26",
        "text": "<p>It’s always a good time to ask for a quick and easy expert opinion, especially when it comes to your home. So why wouldn’t you do a home checkup?&nbsp;</p>\r\n<h4>Ask an expert who actually wants to be asked&nbsp;</h4>\r\n<p>How can you tell who the doctor is at a party? They’re usually the one surrounded by people pointing out their weird pain or crunchy joint. The same goes for computer technicians. Or hairdressers. It’s human nature to try and capitalize on the advice of experts. But that children’s birthday or your cousin’s engagement party isn’t the best time to get advice on your trick knee or whether or not you should dye your hair pink.&nbsp;</p>\r\n<p>And it’s especially not the best time to get advice on the maintenance of your home.&nbsp;&nbsp;</p>\r\n<p>Why is home maintenance important enough for people to hassle someone who is just trying to enjoy their caprese salad in a cup? Because a well-maintained home will run smooth and save you money on utilities. It can also prevent costly repairs later.&nbsp;</p>\r\n<h4>What exactly is a Virtual Home Checkup?&nbsp;</h4>\r\n<p>Rümi’s Virtual Home Checkup allows one of our Rümi advisors - a certified professional home inspector - to virtually assess your home’s key maintenance areas. This means you don’t have to guess at what that strange noise coming the fridge is anymore, and you definitely don’t have to call multiple people into your home who promise to be there sometime between 9 am and noon on Thursday, yet still show up on Friday. You also won’t have to pester your best friend’s cousin twice removed about that rattling coming from the furnace, who may or may not know what they’re talking about.&nbsp;</p>\r\n<p>Rümi’s advisors know what they’re talking about; they’re happy to assess your home and can do so via a convenient video call.&nbsp;<br>\r\n</p>\r\n<p>Though our Virtual Home Checkup makes sense during strange quarantine times, we don’t want you to think it’s a consolation offer. Our virtual home checkups are a great option at any time. They are convenient, efficient and, most importantly, they will give you advice specific to your home—Because you’ve shown our expert your home.&nbsp;</p>\r\n<h4>Find out what you don’t know&nbsp;</h4>\r\n<p>Rümi’s certified professional home inspectors will virtually assess common maintenance areas in your home. They will look at areas of possible concern, as well as suggest maintenance and prevention opportunities. Our experts are also happy to answer all your questions, no matter how basic, to help you take the guess work out of home maintenance.&nbsp;</p>\r\n<p>Not sure how to change a furnace filter? We’ve got you. Freezer no longer making ice? We’ve got you.&nbsp;</p>\r\n<p><b>Together, you and your home inspector will walk through:&nbsp;</b><br>\r\n</p>\r\n<ul>\r\n<li>Your kitchen including hard working appliances like your fridge, dishwasher and exhaust fan.&nbsp;&nbsp;<br>\r\n</li>\r\n<li>The mechanical room including the furnace filter, humidifier, and hot water tank.&nbsp;<br>\r\n</li>\r\n<li>CO2 monitors, smoke detectors, and washer/dryer vents.&nbsp;<br>\r\n</li>\r\n</ul>\r\n<h4>How the heck does this all work?&nbsp;<br>\r\n</h4>\r\n<p>You can get the full <a title=\"Learn more about our Virtual Checkup\" href=\"https://www.rumi.ca/en-ca/services/virtual-home-checkup.html\">scoop</a> here on the Rümi Virtual Checkup. And remember, if you have more questions that we don’t cover during your session, you can book a follow-up appointment to address specific issues that might need extra time and attention.&nbsp;&nbsp;<br>\r\n</p>\r\n<p>Ready to see what shape your house is in? Click the link below to get started. And don’t feel like you need to tidy up on our account. We’re looking for maintenance issues, not dust bunnies!&nbsp;<br>\r\n</p>\r\n<p>Book your <a title=\"Head to our store to book your Virtual Checkup\" href=\"https://shop.rumi.ca/products/rumi-virtual-home-checkup\" target=\"_blank\">Virtual Home Checkup</a> today.&nbsp;<br>\r\n</p>\r\n",
        "articles": [],
        "id": "virtual-home-checkups-648570215"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Home Lawn Maintenance Can be a Walk in the Park",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/lawn-care-artile.jpg",
        "publishedDate": "2020-06-19",
        "text": "<p>You may think it takes a lot of work to get your lawn looking great. In reality, a winning lawn is easier to achieve than you think. You don’t need an advanced degree in lawnology, or experience working the greens of a famous golf course in Scotland, to enjoy a lush, healthy lawn.&nbsp;&nbsp;</p>\r\n<p>All it takes is a simple and regular routine to enjoy green grass all summer long.<br>\r\n</p>\r\n<h4>Lawn Health&nbsp;</h4>\r\n<p>A healthy lawn starts with healthy soil. You’ll want good topsoil that is weed-free and nutrient-rich. Adding compost on an existing lawn or on a newly seeded lawn will give your grass even more of what it needs to grow strong. You can get a lot out of good compost available at retailers or the stuff you produce in your own composting bin. A little goes a long way to helping your lawn grow healthy and lush.&nbsp;<br>\r\n</p>\r\n<h4>Trim&nbsp;</h4>\r\n<p>Mow your lawn regularly with a mower blade set to a height of 2.5” to 3”. This will keep the grass long enough to keep the roots cool and help it retain moisture. Think of the grass as sunscreen for your lawn’s topsoil.&nbsp;<br>\r\n</p>\r\n<p>Ensure the blade of your mower is kept sharp by checking it each spring. A dull blade will give your lawn the botanical version of a bowl cut. Mow when the grass is dry but avoid the heat during the middle of the day. Consider using a mulching blade to return the clippings to the soil where they will compost and add nutrients back into the soil. It’s the circle of lawn life.&nbsp;</p>\r\n<h4>Hydrate<br>\r\n</h4>\r\n<p>Water your lawn deeply but infrequently. Ensure your lawn receives about an inch of water each time you turn on the taps. How can you tell you’ve watered an inch? Place a Frisbee (people still have those, right? If not, use a shallow dish or lid.) upside down and move the sprinkler when it’s full. Water your lawn in the morning to avoid moisture loss during the heat of the midday sun.&nbsp;</p>\r\n<h4>Aerate&nbsp;</h4>\r\n<p>You’ve seen those lawns that look like the homeowner has a pet goose? You know what we’re talking about. Those cylindrical bits are actually signs that the lawn was aerated. This allows for better moisture and oxygen penetration. It can also loosen compacted soil and remove thatch. Aeration can be done each spring when lawn maintenance kicks into gear.&nbsp;&nbsp;<br>\r\n</p>\r\n<h4>Rake/Thatch&nbsp;</h4>\r\n<p>Speaking of thatch, that organic build-up over the topsoil can be a good thing if it’s less than half an inch thick. Any more will prevent moisture absorption. Too much thatch is like dandruff on your lawn. Remove it with a hand rake or a dethatching blade on your lawn mower.&nbsp;<br>\r\n</p>\r\n<h4>Fertilize&nbsp;</h4>\r\n<p>A good lawn fertilizer should be applied beginning in the spring, likely not before May long weekend though, as we always seem to get snow here in Canada. The fertilizer you choose should contain nitrogen for green growth, phosphorus for root growth and potassium for resilience. This is often called 3:1 fertilizer. Be sure to choose a slow-release variety for best results. You can also use natural fertilizers such as compost. Fertilize regularly throughout the summer. Be sure to water your lawn thoroughly after fertilizing and avoid spreading it during a hot day which can cause the fertilizer to burn your lawn.&nbsp;<br>\r\n</p>\r\n<h4>Over seed&nbsp;</h4>\r\n<p>Over seeding sounds bad, but it’s not. Over seeding simply means spreading grass seeds into your existing lawn. Seeding over the existing grass = over seeding. Got it? These seeds will sprout new grass and make your lawn even more lush. Over seeding will also prevent the emergence of weeds and help renew worn out patches of lawn. Sprinkle some topsoil, and compost if you’ve got it, down and then evenly spread the grass seeds. Water thoroughly after.&nbsp;<br>\r\n</p>\r\n<h4>Lawn care A, B, C’s<br>\r\n</h4>\r\n<p>Whether you’re looking for a lawn that your neighbours will be seriously envious of, or just want to have better grass than last year, these basic tips will help get you there.&nbsp;</p>\r\n",
        "articles": [],
        "id": "lawn-care-1948341379"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Living Your Best Summer Life",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/live-best-summer-life-2-artile.jpg",
        "publishedDate": "2020-06-15",
        "text": "<p>December may lay claim to the most magical time of the year, but few would argue that summer is the best time of the year. While it doesn’t take much to make this season feel pretty awesome, Rümi is here to share the hottest tools, tips and accessories to ensure you have more than just some extra fun—<b>we want you to live your best summer life ever.&nbsp;</b></p>\r\n<p>Here’s how:</p>\r\n<p><b>Grill:</b> It isn’t summer if the grill isn’t going. From a wide array of cookers and your <a title=\"Explore Blue Flame Kitchen's favourite grilling recipes\" href=\"https://www.atcoblueflamekitchen.com/en-ca/recipes-menus/menu-plans/backyard-barbecue.html\" target=\"_blank\">favourite foods</a> to cook on them, Rümi’s got your grilling game covered.<br>\r\n</p>\r\n<p><b>Entertain:</b> Hosting guests is fun, if you have the right stuff to do it right. Rümi’s assortment of wine and bar accessories, outdoor essentials and serving solutions are guaranteed to make your guests feel the love, not the burn.<br>\r\n</p>\r\n<p><b>Impress:</b> Every cook needs an assistant. Get a little support from Rümi’s kitchen gadgets and tips to ensure you can savour these moments, not just cook, chop and clean your way through them ‘till fall.<br>\r\n</p>\r\n<p>And…Looking for the best summertime reading? Put down that romance novel and read up on more hot tips from the Rümi archive.</p>\r\n<p>&nbsp;</p>\r\n<h3>Design a Dazzling Outdoor Space</h3>\r\n<p>A few simple design elements can make your outdoor space your favourite “room” in the house.<br>\r\n</p>\r\n<p><b>Ground rules:</b> Outdoor rugs create visual appeal and add a soft landing for bare feet. Everyone will appreciate this no-slivers zone.<br>\r\n</p>\r\n<p><b>Kick back &amp; relax:</b> Large outdoor pillows, benches and rocking chairs look good and feel even better to sink into. Only problem is you might have trouble getting guests to leave at the end of the party.<br>\r\n</p>\r\n<p><b>Shady behaviour</b>: Even the most ardent sun goddesses can appreciate a little shade when the temperature really turns up. Consider installing a pergola, awning or even a standing umbrella to create some shade from the midday rays.&nbsp;<br>\r\n</p>\r\n<p><b>Garden variety: </b>Large planters filled with colourful blooms and greenery look great, smell beautiful and can help delineate different hang out zones if you have a larger outdoor area.<br>\r\n</p>\r\n<p><b>Light it up: </b>If your afternoon barbecues tend to turn into evening soirées, twinkling lights help set the mood. Drape string lights from a pergola or across your outdoor space to give it a starry-night feel. Or, line any patio or garden path with torches or lanterns for soft lighting guaranteed to take 10 years off your face, not that you need that.<br>\r\n</p>\r\n",
        "articles": [
            {
                "title": "Bringin' The Heat",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/summer-grilling-block.jpg"
            },
            {
                "title": "Chill Out",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/summer-drinks-block.jpg"
            },
            {
                "title": "Creative Cooking",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/creative-cooking-block.jpg"
            }
        ],
        "id": "living-your-best-summer-life-248881062"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Summertime's Home Maintenance Checklist",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/summertime-home-maintenance-artile.jpg",
        "publishedDate": "2020-06-12",
        "text": "<h4>Inspect air-conditioners </h4>\r\n<ul>\r\n<li>Prep air conditioners and fans for their busiest season. <br />\r\n</li>\r\n<li>Install window air-conditioning units. This is a two-person job, so make sure you grab a buddy to help with the heavy lifting. <br />\r\n</li>\r\n<li>Remove and clean the filters before firing up the AC. If you have central AC, consider hiring a professional for a thorough cleaning and inspection. <br />\r\n</li>\r\n<li>Clean all fans with a damp rag. Most portable fans have a removeable cage that you can unlatch to clean the blades. A ceiling-fan duster can help de-grime hard-to-reach areas. Just make sure you follow proper ladder safety if your ceilings are extra high. No sense in spending the sunniest time of year on the couch in a cast.  <br />\r\n</li>\r\n</ul>\r\n<h4>Give your clothes dryer a vacation <br />\r\n</h4>\r\n<ul>\r\n<li>Install an outdoor clothesline, or set up your dryer rack outside, to dry your laundry in the summer sun. You’ll save money on energy bills, and who doesn’t love the smell of air-dried sheets? Plus, natural sunlight is particularly good at making whites even brighter. One more reason to invest in those new summer shades you’ve had your eye on. Just sayin’.  <br />\r\n</li>\r\n</ul>\r\n<h4>Outdoor cookers <br />\r\n</h4>\r\n<ul>\r\n<li>Nobody wants to taste last summer’s grease on this summer’s burgers. Give your grill a deep cleaning to ignite the season. <br />\r\n</li>\r\n<li>Gas grills: Turn the heat up and let the grill run with the lid closed for half an hour. Let it cool and brush off any icky residue left on cooking surfaces with a <a href=\"https://shop.rumi.ca/collections/outdoor-living-s/products/the-animal-cool-use-grill-cleaning-brush\" target=\"_blank\" title=\"View our Rümi Store to purchase a grill brush\">grill brush</a>. Wipe down the exterior with a damp sponge and <a title=\"View our Rümi Store to purchase a gentle cleanser\" href=\"https://shop.rumi.ca/collections/outdoor-living-s/products/grill-cleaner-and-degreaser\" target=\"_blank\">gentle cleanser</a> and then wash out the drip pans. You’ll be cooking with gas in no time. <br />\r\n</li>\r\n<li>Charcoal grills: For some, it ain’t grilling if it ain’t over an open flame. That’s fine, but you still have to clean your baby, we mean, grill. Empty out any leftover ash and charcoal and scrub the whole thing, inside and out, with hot water and a little liquid dishwashing soap. Let your grill dry completely before using it again. You’ll have the prettiest grill on the block. <br />\r\n</li>\r\n</ul>\r\n<h4>Polish your porch <br />\r\n</h4>\r\n<ul>\r\n<li>Your porch probably took a beating over the winter and spring. Ice, mud, harsh temperatures, the works. Show your porch some love by sweeping painted porch floors first, followed by a good mopping with an all-purpose cleaner. You may even need to scrub floorboards with a brush if there’s a lot of grime to get through. <br />\r\n</li>\r\n</ul>\r\n<h4>Analyze your deck <br />\r\n</h4>\r\n<ul>\r\n<li>Look over your deck for signs of rotting, and hammer in any nails that are poking up. Does your deck need new sealing? Sprinkle water on the deck's boards. If the water beads up, you're in good shape; if it soaks right in, it's time to reseal it. <br />\r\n</li>\r\n</ul>\r\n<h4>Perk up patio furniture<br />\r\n</h4>\r\n<ul>\r\n<li>Whether your patio furniture is made from plastic, iron, or painted or finished wood, the cleaning technique is the same. Rinse down furniture to start. Then, prepare a vinegar solution (mix one cup of vinegar to every three to four litres of hot water) and scrub the mixture onto surfaces with a sponge. Learn more about the advantages of cleaning with vinegar here. <br />\r\n</li>\r\n</ul>\r\n<h4>Mulch to do<br />\r\n</h4>\r\n<ul>\r\n<li>Adding a layer of mulch to garden beds keeps weeds down and helps the soil retain its moisture. Your annuals and perennials with thank you. <br />\r\n</li>\r\n</ul>\r\n<h4>Lose the leaks<br />\r\n</h4>\r\n<ul>\r\n<li>Did you know that even a tiny drip in an outdoor hose or faucet can add up to big wastes of water? Fix pinhole leaks in hoses by wrapping electrical tape around the hose when it’s dry. Faucet leaks may require the services of a pro plumber. <br />\r\n</li>\r\n</ul>\r\n<h3> </h3>\r\n<h3>Summer Livin’ is Easy<br />\r\n</h3>\r\n<p>And there you have it. A good starter list for basic summertime household maintenance. Oh sure the sky is the limit when it comes to finding things to wash, refresh and fix, but we wanted to make sure you still have some time to enjoy the season before it’s gone again. <br />\r\n</p>\r\n<p>If you need a little help keeping up on home maintenance, give us a shout today to <a title=\"View our Book a Service page.\" href=\"https://www.rumi.ca/en-ca/book-service.html\">book a service</a>. <br />\r\n</p>\r\n",
        "articles": [],
        "id": "summertime-home-maintenance-2053604063"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "9 Ways to Unclog a Kitchen Drain (Without a Plumber!)",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/unclogging-drains-artile.jpg",
        "publishedDate": "2020-06-09",
        "text": "<p>Before you call the plumber to unclog your kitchen drain, put down that phone and read on, You, yes you, can try to unclog a kitchen drain before enlisting the services of a pricey plumber. Roll up your sleeves, move that stack of greasy dishes to the side, and give these do-it-yourself suggestions a try.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p style=\"margin-left: 40px;\"><b>1. Boiling Water&nbsp;<br>\r\n</b>So easy. So cheap! Is there any reason not to try this one first? While you’re waiting for the water to boil, remove as much of that icky standing water from the sink as possible. You’ll want to wear some rubber gloves for this one. When the water is heated, pour the entire kettle into the sink and wait. Do a jig. Sing a song. Do another jig. Just make sure you give the water time to work its magic. Repeat the process several times if the clog hasn’t budged, because seriously, this technique really does oftentimes do the trick.&nbsp;</p>\r\n<p style=\"margin-left: 40px;\">&nbsp;</p>\r\n<p style=\"margin-left: 40px;\"><b>2. Salt &amp; Boiling Water<br>\r\n</b>Just like you, your kitchen drain may enjoy a nice exfoliation once in a while. While boiling water can help loosen up debris, coarse salt actually scours the inside of your pipes, removing more material than hot water alone. After removing standing water from the sink, pour about one-half cup of table salt down the drain before you pour in the boiling water. Let it sit for a few minutes, and then flush with hot water to clear the mixture.&nbsp;</p>\r\n<p style=\"margin-left: 40px;\">&nbsp;</p>\r\n<p style=\"margin-left: 40px;\"><b>3. Vinegar &amp; Baking Soda<br>\r\n</b>Turns out, everyone’s favourite grade school science experiment (we’re talking Papier Mache volcano) is actually useful! We all know that vinegar and baking soda create quite a fizzle when combined. Well, that’s exactly what it might take to jolt loose that sticky drain debris.&nbsp;&nbsp;</p>\r\n<p style=\"margin-left: 40px;\">Again, remove standing water first, pour about a cup of baking soda into the drain, followed by an equal amount of white or apple cider vinegar. The solution will bubble. That’s good! It means the chemical reaction is working. When the bubbles subside, place a stopper on the drain and wait 15 minutes. Run hot water to see if the clog has cleared and repeat if necessary.&nbsp;&nbsp;<br>\r\n</p>\r\n<p style=\"margin-left: 40px;\">&nbsp;</p>\r\n<p style=\"margin-left: 40px;\"><b>4. Baking Soda &amp; Salt<br>\r\n</b>If you want super-powered scrubbing without the bubbles, try baking soda and salt together. Mix about a cup of baking soda with one-half cup of salt and pour down the drain. Let this abrasive combination sit for several hours before flushing with boiling water. Repeat the process a few times as needed.&nbsp;</p>\r\n<p style=\"margin-left: 40px;\">&nbsp;</p>\r\n<p style=\"margin-left: 40px;\"><b>5. Plunger<br>\r\n</b>Oh, the plunger. If the salt, and baking soda, and vinegar combinations didn’t do the trick, then step it up a notch. If you have a double sink, first seal off the second side with a wet cloth or stopper. Next, since the plunger requires a tight seal to work, fill the sink in question with enough water to submerge the bell of the plunger. Then, plunge away. When you hear that suuuuuuction clear the clog, remove the plunger and flush drain well with warm water. Oh, and please wash your hands afterwards. Thanks.&nbsp;</p>\r\n<p style=\"margin-left: 40px;\">&nbsp;</p>\r\n<p style=\"margin-left: 40px;\"><b>6. Garburator<br>\r\n</b>Check to make sure it’s not your garburator that's causing the problem. A clogged device can wreak as much havoc as a clogged drain. If the flywheel is jammed, you may be able to free it using that little wrench supplied by the manufacturer (yes that’s what that thing is for). Follow the manufacturer’s instructions about where to insert the tool and how to turn it. You can probably look instructions up online if you don’t have them on hand.&nbsp;&nbsp;</p>\r\n<p style=\"margin-left: 40px;\">Please, PLEASE unplug your device before dreaming of sticking your hand down there. But actually, instead of your hand, first use a flashlight to determine what’s causing the issue, and then use pliers or tongs to remove any item’s that have been caught.&nbsp;<br>\r\n</p>\r\n<p style=\"margin-left: 40px;\">&nbsp;</p>\r\n<p style=\"margin-left: 40px;\"><b>7. P-Trap<br>\r\n</b>The P-trap is that bended piece of drainpipe underneath the sink, usually tucked away in a cabinet. Debris can build up in the bend, and sometimes it just needs a good cleaning. Believe it or not, it’s easy to do this yourself! Place a bucket underneath the P-Trap before removing it. We guarantee some gunk will fall out, but you can handle it. Unfasten the P-trap from the drainpipe and clear out anything that’s stuck. Replace and run water through it.&nbsp;</p>\r\n<p style=\"margin-left: 40px;\">&nbsp;</p>\r\n<p style=\"margin-left: 40px;\"><b>8.&nbsp;Plumber’s Snake<br>\r\n</b>Unleash your inner plumber. Also called an auger, a plumber’s snake can clear clogs that may be stuck further down the system. Consider unscrewing the P-trap and stub pipe (the arm that connects the sink to a central household drainage pipe) and insert the snake into the pipe until you feel resistance. That’s probably where the clog is. Try to break it up with the coiled metal and then pull it out. Just make sure you don’t scrape up the insides of your pipes, because that can cause leaks. If you hear any scratching, quit what you’re doing and readjust the snake.&nbsp;</p>\r\n<p style=\"margin-left: 40px;\">&nbsp;</p>\r\n<p style=\"margin-left: 40px;\"><b>9. Coat Hanger<br>\r\n</b>This one really makes you feel like MacGyver. A good old wire coat hanger might be the most underrated tool of them all. Straighten out a standard hanger and insert it exactly where we suggested in the Plumber’s Snake section above. Obviously, the hanger can’t reach as far as a snake, but in many cases, you’ll still reach the clog. Get ready for the title of Household Hero to be bestowed upon you.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><b>Healthy Sink Maintenance<br>\r\n</b>Your sink appreciates regular maintenance to keep it running smooth and smelling fresh. For routine cleaning, you can use the vinegar and baking soda method mentioned above by pouring equal parts vinegar and baking soda down the drain before flushing with hot water.&nbsp;&nbsp;</p>\r\n<p>If you do have a garburator, don’t overload it. Show some respect! It’s designed to be a kitchen helper, not a miracle worker!&nbsp;&nbsp;<br>\r\n</p>\r\n<p>Finally, <i>never</i> put bacon grease, coffee grounds or oils down your kitchen drain. If you need to keep a mug next to the sink for the explicit purpose of capturing oils from a pan before placing in the sink, then so be it. Just make sure your spouse doesn’t mistake it for their morning coffee.&nbsp;<br>\r\n</p>\r\n",
        "articles": [],
        "id": "unclogging-drains-2112152226"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Hone Your Grill Skills: Tips & Tricks Every Novice Griller Needs to Know",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/grill-like-boss-artile.jpg",
        "publishedDate": "2020-05-29",
        "text": "<p>&nbsp;</p>\r\n<h2><span style=\"font-weight: normal;\">Grilling is Life</span></h2>\r\n<p>Everybody loves a good ol’ backyard barbecue. It’s equal parts primal and social and allows your friends and family to bond over a great meal. Even if you’re a newbie, it’s pretty easy to become the hero of your grill. And the best part? The more you practice, the better you’ll get.</p>\r\n<p>Sure, there’s a lot of science behind the awesome flavour of grilled food (Maillard Reaction, anyone?), but let’s just say that a barbecue makes everything taste delicious. Everything. Sure, you’ll likely grill your share of hot dogs and hamburgers, but you can also make seafood, pizza, desserts and whatever else you’re creative enough to try.</p>\r\n<p>Don’t be shy, let’s get you grillin’.</p>\r\n<h3><span style=\"font-weight: normal;\">Rumi’s Top 5 Tips on How to Hone Your Grill Skills:</span></h3>\r\n<p><b>1.&nbsp;&nbsp;Pick the Grill That’s Right for You</b></p>\r\n<p>When it comes to choosing your grill, the options seem endless. Some people love the natural flavour of a charcoal grill, some love the convenience of a gas grill, while others love the complexity and attention to detail required to use a wood smoker. The set-up you choose should be based on your personal preferences.<br>\r\n</p>\r\n<p>How do you know what’s right for you? Ask around. The next time you’re at a backyard barbecue, talk to the people hovering around the grill. Just like the guys who stand in front of any car with its hood up, the people who stand around the grill are the ones with passion and curiosity. Talk to the folks who sell grills and smokers. Talk to chefs and barbecue fans you know. They may not be willing to part with their secret, award-winning dry rub recipe, but they’ll be more than happy to talk grilling in exchange for an icy beverage.</p>\r\n<p><b>2.&nbsp;&nbsp;Get Your Grill Essentials</b></p>\r\n<p>Once you’ve picked your grill, it’s time to carve out and set-up your little slice of grilling paradise.</p>\r\n<p>Set your new grill up in a safe, level spot away from anything that could be damaged by the heat. We’ve all seen that house with the melted and soot-stained siding in the backyard. The likely cause? A grill placed too close to the home.</p>\r\n<p>And whatever you do, don’t be the person who uses regular kitchen tools on their fancy new grill. Get yourself a set of proper utensils designed for the grill. They’ll be longer and made to withstand actual open flames. This <a href=\"https://shop.rumi.ca/collections/outdoor-living-s/products/geminis-6-piece-travel-bbq-set\" title=\"Visit our Rümi store to purchase a Travel Barbeque Set\">travel barbecue set</a> has everything you need to get started. You can even get creative with the variety of pans, racks and stands that are available for grilling all kinds of cool food.</p>\r\n<p>Last but definitely not least, learn to play with spices and flavours. Stack your pantry and fridge with spices, rubs, marinades and sauces crafted specifically for grilling. Explore and experiment. How important are spices and flavours? Well, Christopher Columbus discovered an entire continent on his epic search for a quicker spice trading route.</p>\r\n<p>A good grill, some good tools and some interesting flavours. That’s it; those are your essentials.</p>\r\n",
        "articles": [],
        "id": "hone-your-grill-skills-2061174671"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Vinegar for the win!",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/cleaning-vinegar-article-tile.jpg",
        "publishedDate": "2020-03-16",
        "text": "<p>Cooking, cleaning— is there anything vinegar can’t do?</p>\r\n<p>Many people mistakenly think that vinegar will disinfect, so there is one thing it won't do.</p>\r\n<p>Long a staple in our favouite dishes, vinegar is still a recipe for success when&nbsp;looking for a natural alternative to chemical-based cleaning products.&nbsp;</p>\r\n<p>So grab that bottle of vinegar lounging in the back of your cupboard, and put it to work around your home. We’ve tested all these tips, but you should always check your owner’s manuals before using any of the following techniques.</p>\r\n<h4>Kitchen</h4>\r\n<p>The kitchen represents the bread basket of our home. Introducing harmful cleaning chemicals, however, is like inviting an unwanted guest to the dinner table.</p>\r\n<p>The good news is you don’t have to go too far for a natural alternative. From the pantry to the pan, vinegar is a Goldilocks solution to cleaning some of your kitchen’s most stubborn messes.</p>\r\n<p>Start by tackling tenacious mineral deposits left over from hard water on small appliances such as kettles and coffee makers. Fill your kettle with a solution of one-part vinegar and one-part water. Let sit for two hours and then rinse with water. Boil clean water in the kettle and discard the water before using it again. For your coffee maker, soak the reservoir for an hour, run it through twice and then rinse thoroughly.</p>\r\n<p>Vinegar is also a born natural leader when it comes to cleaning glassware that looks dull and cloudy, even after coming out of the dishwasher. Soak the glass in warm water for 15 minutes, and then scrub lightly with a soft brush and warm, soapy water.</p>\r\n<p>Speaking of dishwashers, vinegar is great at loosening leftover food, grease, detergent and soap scum. Every couple of weeks, place a half-full glass or mug with vinegar in the bottom rack and run the dishwasher through a rinse cycle. As an added bonus, it will also eliminate musty odors.</p>\r\n<h4>Bathroom</h4>\r\n<p>Start spreading the news! Vinegar offers a modern-day and more eco-friendly life hack to cleaning streaky mirrors. Mix equal parts water and vinegar into a bottle and spray evenly over the mirror. Use a mico-fibre cloth or squeegee to wipe down.</p>\r\n<p>Vinegar can also be used to tackle dull-looking showers and stained toilet bowls. Mix with baking soda in a spray bottle to reduce soap scum and mildew from the shower. For hard water stains in the toilet, mix one cup of vinegar in the bowl. Add one cup of baking soda, followed by another cup of vinegar. Let sit for up to 30 minutes, occasionally mixing with a toilet bowl brush. Scrub and then flush.</p>\r\n<h4>Around the home</h4>\r\n<p>When it comes to achieving a streak-free floor, vinegar offers a non-toxic alternative to traditional chemical-based cleaners. Mix one cup of vinegar to every three to four litres of hot water. Apply to linoleum or tile floors only. Avoid using on hardwood floors, where the acidity in vinegar can break down the finish over time.</p>\r\n<p>If your favourite fur-baby has left an unpleasant surprise on your carpet, you know what to do. Grab the vinegar. Use an enzymatic carpet cleaner first, then mix one tablespoon of baking soda, one tablespoon of vinegar and two cups of hot water in a spray bottle. Apply to the stain, let sit for a couple minutes and blot out well. (Speaking of deodorizers, diluted vinegar can also be used to rinse out refrigerators and freezers.)</p>\r\n<p>Lastly, vinegar can help descale several small appliances around the home, including humidifiers and steam irons. Use equal amounts of water and vinegar and allow to soak for an hour. Flush out with clean water.</p>\r\n<p>With just a couple ingredients, you can safely bring your home from blah to bling in no time. Call one of our home care experts to get even more great tips on how to care for any area of your home.</p>\r\n",
        "articles": [
            {
                "title": "Cleaning Tips for your Living Room",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/living-room-cleaning-article tile.jpg"
            },
            {
                "title": "Cleaning Your Floors",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/cleaning-floors-article-tile.jpg"
            },
            {
                "title": "Seasonal Cleaning Checklist",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/seasonal-cleaning-checklist-artile.jpg"
            }
        ],
        "id": "clean-your-home-vinegar-naturally-178307702"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Cleaning Tips for Your Living Room You Can’t Live Without ",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/living-room-cleaning-article tile.jpg",
        "publishedDate": "2020-02-14",
        "text": "<p>Did you save all the care instructions for your furniture, carpets and window treatments? Yeah, we thought so. If you’re like most homeowners who don't have care instructions on hand, check out this short list of common cleaning concerns before attempting to wash (read: possibly damage or ruin) the various surfaces and fabrics in your home.</p>\r\n<h4>Dusting</h4>\r\n<p>Dust in a top-to-bottom motion and use a dampened (micro or soft) cloth to wipe down all surfaces. And don’t just dust the places that are easy to reach! You’re not a teen cleaning their bedroom, are you? It’s also a good idea to dust before you clean your floors so that your final mop can catch that rogue dust that escapes your cloth and settles on the floor. Learn the mantra: Dust first. Mop second. Dust first. Mop second. Got it? Now, stick to the system to ensure your cleaning efforts will not have been in vain.</p>\r\n<h4>Leather Furniture</h4>\r\n<p>You know what they say, “leather is forever.” Make sure it stays that way by wiping down furniture as needed with a dampened cloth, and vacuum between cushions and in seams with a narrow vacuum attachment (you might even find loose change!). Also, unless any specific care guide says otherwise, only use products designated for leather, and condition occasionally with leather conditioner. It’s not pretty otherwise.&nbsp;</p>\r\n<h4>Fabric Furniture</h4>\r\n<p>Vacuum regularly to combat wear. Many fabrics can’t be deep cleaned or treated at home, so call our&nbsp;<a href=\"https://www.rumi.ca/en-ca/services/upholstery-cleaning.html\" title=\"Learn more about our Upholstery Cleaning Services\">home care experts</a>&nbsp;for advice before doing something as regretful as what you did that one Halloween in college.</p>\r\n<h4>Finished Wood</h4>\r\n<p>Finished wood has a protective coating and only requires a damp wiping, as needed. However, some woods may require an occasional conditioning, so either check the guide that came with your piece (if you did in fact keep it), or go all private investigator and Google around to find the best care instructions out there.&nbsp;</p>\r\n<h4>Granite or Marble</h4>\r\n<p>Dust or wipe with a (barely) damp cloth. Only use products specifically designed for these surfaces. If you’re old enough to have nice things, you’re old enough to take care of them… Sorry, not sure why we just sounded like our mother for a second there. Our bad. Won’t happen again.</p>\r\n<h4>Natural Stone</h4>\r\n<p>Many stone surfaces don’t have a protective coating and may absorb permanent stains. Read: DO NOT place a greasy pizza box on one of these surfaces. You will regret that. But DO check with a manufacturer of stone products for best ways to clean your furniture.</p>\r\n<h4>Carpets</h4>\r\n<p>Only vacuuming the high traffic areas of your carpet is like wearing a hat for a week straight to hide a bad haircut. Eventually, everyone is going to notice. Be sure to vacuum behind doors, under furniture and along the walls (where you may need an adaptor…provided you know where in the heck it is hiding at the back of your utility closet). It’s also wise to deep clean carpets at least once a year to ensure they look their best and have a long lifespan.&nbsp;<a href=\"https://www.rumi.ca/en-ca/services/carpet-cleaning.html\" title=\"Learn more about our Carpet Cleaning Services\">We can help with that.</a></p>\r\n<h4>Window Blinds</h4>\r\n<p>Even if your neighbours aren’t the nosy kind, they still see your blinds every day. So it’s a good idea to keep them clean. Caring for blinds is easy with tools designed specifically for doing just that or use a microfibre cloth to get things squeaky. If you opt for a cloth, turn the blinds in one direction and wipe, then turn the other way and do the same. Easy peasy.&nbsp;</p>\r\n<p>There are two kinds of living rooms—The museum kind your grandmother never let you near, and the one most of us have. The living room, and the rest of your home, is busy, full of high traffic, and contains many different surfaces with many different cleaning needs. Call one of our home care experts anytime for some realistic advice on how to care for your real-life home.&nbsp;</p>\r\n",
        "articles": [
            {
                "title": "Cleaning your Floors",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/cleaning-floors-article-tile.jpg"
            },
            {
                "title": "Cleaning with Vinegar",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/cleaning-vinegar.jpg"
            },
            {
                "title": "Cleaning your Dishwasher",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/dishwasher-cleaning-artile.jpg"
            }
        ],
        "id": "cleaning-tips-living-room-cant-live-without-1176376980"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Smoke Detector Safety: Master These Quick Steps",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/smoke-detector-safety-article-tile.jpg",
        "publishedDate": "2020-02-13",
        "text": "<p>Sometimes, providing home happiness means getting serious. Fire safety is about as serious as it gets around the home. Fully functioning smoke detectors and fire alarms can save a lot more than just your property.</p>\r\n<p>Smoke detectors and fire alarms are so common, it’s easy to forget these life-saving devices still need regular maintenance. They’re NOT just like a piece of the furniture! That’s why we’ve highlighted a few simple things you can do today to make sure your smoke detector gets some efficient, effective, and regularly scheduled attention.&nbsp;</p>\r\n<h4>Do I Really Need to Check My Smoke Detector?</h4>\r\n<p>Yes!! Not&nbsp;<i>maybe</i>. Not&nbsp;<i>if you feel like it</i>. But yes, yes, yes—and on a regular schedule. Electronic devices aren’t foolproof. Seriously, did that battery-powered karaoke machine ever perform as advertised? Batteries die or corrode, dust may interfere with sensors, and other device components can wear out over time. Regular testing will reveal if your detector could use a good cleaning or needs to be replaced completely.</p>\r\n<h4>How Often Should I Check My Devices?</h4>\r\n<p>Smoke detectors should be tested&nbsp;<b>at least once a month</b>&nbsp;(yes, you read that right), and batteries should be replaced at least once or twice a year. You can change the batteries when you change your clocks for daylight savings—a foolproof way to stay on that twice-per-year schedule.</p>\r\n<h4>Signs your smoke detector should be checked more frequently, or replaced entirely include:</h4>\r\n<ul>\r\n<li>The detector gives false alarms</li>\r\n<li>The alarm emits short beeps without anyone touching it</li>\r\n<li>Kitchen smoke activates it often, which may wear it out faster</li>\r\n</ul>\r\n<p>Check your detector’s user manual if anything else seems strange. Don’t worry, there’s usually an online version as well. Because really, who actually remembers where they put that manual?&nbsp;</p>\r\n<h4>My Detectors Are Hardwired. Do I Still Need to Check Them?</h4>\r\n<p>Again, yes! You had to expect that would be the answer, right? While the hardwired variety are powered by your home’s electrical system, they do have backup batteries that kick in if your home loses power. Yep, these devices still require monthly testing to ensure that the batteries and all the other parts are functioning properly.</p>\r\n<h4>How Do I Test It?</h4>\r\n<p>Check manufacturer’s instructions for proper testing protocol, but in general, most battery-powered and hardwired smoke detectors can be tested in the following way:</p>\r\n<ol>\r\n<li>Alert family members that you will be testing the device. You don’t want to scare the pants off of anyone by setting off a high-pitched noise.<br>\r\n<br>\r\n</li>\r\n<li>Station someone at the furthest point from the detector. No, not your dog. A real person who can do more than howl if they hear a loud noise. We’re just kidding, of course, but ensuring the alarm reaches every corner of your home is no joke. Install extra devices if necessary.<br>\r\n<br>\r\n</li>\r\n<li>Press and hold the test button on the smoke detector. Wait a few seconds and prepare yourself for a sound so loud you&nbsp;<i>feel</i>&nbsp;it. If the alarm is weak or not audible, replace the batteries and check it again. If it’s been more than six months since you replaced the batteries (whether your detector is battery-powered or hardwired), change them now regardless of the test result. Test the new batteries one final time to make sure everything’s working properly. Simple stuff for such a long paragraph!<br>\r\n</li>\r\n</ol>\r\n<p>Also, take this time to inspect your smoke detector for built-up dust or debris that could be blocking its grates.</p>\r\n<h4>Safety First</h4>\r\n<p>Smoke detectors have a normal life span of about ten years. Even with regular maintenance, you should replace yours every decade. Think, when it’s time to give your hairstyle a serious reboot, it’s probably time to change your detector.</p>\r\n<p>Our hope is that you’ll never need your smoke detector or fire alarm, but these easy-to-follow smoke detector safety tips will make sure you’re prepared.</p>\r\n",
        "articles": [
            {
                "title": "Dryer Vent Cleaning",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/cleaning-dryer-vent-artile.jpg"
            },
            {
                "title": "Fixing Your Main Water Shutoff Valve",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/water-shutoff-valve-artile.jpg"
            }
        ],
        "id": "smoke-detector-safety-1580410202"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Ground Rules For Cleaning Your Floors",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/cleaning-floors-article-tile.jpg",
        "publishedDate": "2020-02-13",
        "text": "<p>Your floors can take an absolute beating. Kids, pets, spills, sliding furniture…we’ve all been there. Take care of your floors, and they’ll look better and last longer. For extra credit, clean them at least once a week—but since this is an advice section for actual humans with busy lives, we’ll just say, “clean when you can or as needed.”</p>\r\n<h4>Tile &amp; Vinyl</h4>\r\n<p>Vacuum, sweep or dust when you can no longer stand to see the remnants of last week’s midnight snack strewn across the floor. To wash, use a drop of dish soap or all-purpose cleaner in a bucket of hot water and then rinse, if needed. Or don’t rinse if that extra step is going to hold you back from cleaning in the first place.</p>\r\n<h4>Hardwood &amp; Laminate&nbsp;</h4>\r\n<p>Vacuum regularly using the floor setting to avoid scratches. Yes, there is a “floor setting” on some vacuum models. If your vacuum doesn’t have one, swapping out to a softer vacuum head will work as well. And if you don’t have that, well, just be gentle. Wash these surfaces with water or a hardwood cleaner, then dry with a soft towel. Don’t use vinegar, because the acid in the vinegar may eventually break down your floor’s finish and leave it looking dull. And beware of commercial wet-mop products with chemicals that can build up and leave your floor feeling tacky. (We’d insert a tacky joke here, but that’d be too easy. A dirty joke about being clean? Maybe, but we wouldn’t want to get into a sticky situation).&nbsp;</p>\r\n<h4>Carpets &amp; Area Rugs</h4>\r\n<p>Vacuum frequently and clean up spills immediately (or when you finally notice them) to prolong the life of your carpets and rugs, and give those carpets a deep clean on the regular. You could also try a good entryway mat or rug to reduce the amount of grime tracked inside. Just think, encouraging kids to actually wipe their feet on said entryway mat will be a fun challenge since you probably don’t have too much on your plate as is!</p>\r\n<h4>Linoleum</h4>\r\n<p>Remember that phase when people covered up real hardwood floors with linoleum? Well, if linoleum can be that important, it should at least be kept clean. Adding a little vinegar to the rinsing water will give your efforts a boost and show the lino some respect. But make sure it’s real-deal linoleum. Vinegar doesn’t play well with hardwood or laminate.&nbsp;</p>\r\n<p>With the right products, tools and cranked up tunes, you’ll be well on your way to sparkling floors and freshened-up carpets. Call one of our home care experts anytime for even more great tips and advice on how to care for your floors and everything else in your home.</p>\r\n",
        "articles": [
            {
                "title": "Cleaning with Vinegar",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/cleaning-vinegar.jpg"
            },
            {
                "title": "Unclog your Kitchen Drain",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/unclogging-drains-artile.jpg"
            },
            {
                "title": "Cleaning your Dishwasher",
                "fileReferene": "https://www.rumi.ca/content/dam/web/rumi/stories/dishwasher-cleaning-artile.jpg"
            }
        ],
        "id": "ground-rules-cleaning-floors-1652942126"
    },
    {
        "heroBannerImage": "https://www.rumi.ca/content/dam/web/rumi/rumi-house-illustration-half-banner.jpg",
        "title": "Freeze Your Energy Bill This Winter",
        "articleImage": "https://www.rumi.ca/content/dam/web/rumi/stories/thermostat-article-tile.jpg",
        "publishedDate": "2020-02-13",
        "text": "<p>There are lots of things we love about winter – hot chocolate, snow forts and a good ol’ curling bonspiel to name a few. But not everything about winter is fun and games. Energy bills do tend to rise when the temperature drops, but that doesn’t mean you can’t show your bill who’s boss. There are plenty of easy ways to control your energy costs and give your wallet that break it probably needs. <br />\r\n</p>\r\n<h4>Appliances</h4>\r\n<p>Many appliances still draw energy when not in use. This phenomenon even has a catchy name: phantom energy. So, unplug TVs, gaming consoles, computers and printers when you don’t need them, and finally ghost that power sucking phantom who wasn’t good for you anyways. </p>\r\n<p>Do you really need to use the oven? A microwave or toaster oven are so much more energy efficient. While many family favourites like casseroles, soups and pasta dishes withstand the microwave just fine, other foods were never meant to go near it. The toaster oven is a great alternative to your traditional oven when nuked rubber chicken is definitely not on the menu. If you are going to use the traditional oven, make the most of it. Prep multiple dishes at once to minimize the time and energy required to pre-heat, cook and humble brag about your <a href=\"https://www.atcoblueflamekitchen.com/en-ca/recipes-menus/recipes/cilantro-orange-ribs.html\">ribs</a> and <a href=\"https://www.atcoblueflamekitchen.com/en-ca/recipes-menus/recipes/cornbread-minis.html\">mini cornbread muffins</a>. </p>\r\n<h4>Heating</h4>\r\n<p>Close doors and vents in unused guest rooms. Don’t let them get so cold they freeze plumbing, obviously, but they also don’t need to be toasty warm AND totally empty. </p>\r\n<p>Wear your fuzzy slippers because you love them – not because you need them. A warmed-up basement also helps keep your ground floor warmer. Keep those tootsies toasty. Say that three times fast.</p>\r\n<p>Blinds typically beat fabric when it comes to insulating windows. However, if your blinds don’t cut it, there are specialty insulated drapes and blinds available to pack a bigger punch to winter drafts. </p>\r\n<p>Kick off cold weather season with a new furnace filter. You might be asking, “What’s a furnace filter? Where does it go? How do I even know what size to buy or what to do with it once I’ve bought it?” Don’t worry, <a href=\"https://www.rumi.ca/en-ca/services/duct-furnace-cleaning.html\" target=\"_self\">we’ve got the answers</a> to all those questions swirling in your brain. We’ve got your back.</p>\r\n<h4>Water</h4>\r\n<p>Is it time to go tankless? We know a water heater isn’t the most exciting purchase you’ll ever make. At least we really hope it’s not. But if it’s time for a new one, consider going tankless. Tankless water heaters are up to 35% more efficient than storage tank water heaters. They cost more up front, but last twice as long as a conventional hot water heater. It could be your energy-saving BFF for the next 30 years. </p>\r\n<p>Change up your morning routine. Does your hot water need to be, well, so hot? Lower the temperature on your hot water tank by just a few degrees and knock off usage by a few percentage points. Speaking of hot water, using less altogether means less energy to heat it, and less time waiting to use the bathroom during the morning rush.</p>\r\n<p>Using reduced-flow shower heads is another way to save. They take mere moments to install but drastically decrease water usage. Pro tip: You don’t need to sing every one of your favourite 80s songs while you shower. Edit that playlist and keep it brief.</p>\r\n<p>The washing machine in many households works overtime. So, use less water as you use the machine for what can seem like never-ending loads of laundry. Seriously, where does it all come from? High efficiency washing machines require a fraction of the water that old school machines do, which converts into real savings over time.</p>\r\n<h4>Vehicle</h4>\r\n<p>Did you know you don’t have to plug in your car until temperatures fall below -15°C? Did you also know your block heater only needs two hours to warm up? So, don’t plug in before you have to. A timer will help save you energy and trips out into the deep freeze to switch on the power.</p>\r\n<p>Well-maintained vehicles run much more efficiently in colder weather (all year, in fact, but this is a post about winter). Keeping oil clean, tires properly inflated and excess baggage out of the car all help boost efficiency; meaning you’ll get more bang for your buck whether you’re driving a brand-new Tesla or a ’95 Riviera. </p>\r\n<p>There are so many ways to maximize household efficiency. You can call one of our energy experts any time to discuss these tips and other swaps that are easy to make. The reward? Being able to display your super low energy bill on the fridge the next time your mother comes over, of course. </p>\r\n",
        "articles": [],
        "id": "freeze-your-energy-bill-this-winter-984244186"
    }
]